HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMsc_bf.h
/** \brief Length for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_LEN (1u)

/** \brief Mask for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_OFF (27u)

/** \brief Length for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_LEN (1u)

/** \brief Mask for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_OFF (28u)

/** \brief Length for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_LEN (1u)

/** \brief Mask for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_OFF (29u)

/** \brief Length for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_LEN (1u)

/** \brief Mask for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_OFF (30u)

/** \brief Length for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_LEN (1u)

/** \brief Mask for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_OFF (31u)

/** \brief Length for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_LEN (8u)

/** \brief Mask for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_MSK (0xffu)

/** \brief Offset for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_OFF (0u)

/** \brief Length for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_LEN (1u)

/** \brief Mask for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_MSK (0x1u)

/** \brief Offset for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_OFF (16u)

/** \brief Length for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_LEN (1u)

/** \brief Mask for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_MSK (0x1u)

/** \brief Offset for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_OFF (17u)

/** \brief Length for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_LEN (1u)

/** \brief Mask for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_MSK (0x1u)

/** \brief Offset for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_OFF (18u)

/** \brief Length for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_LEN (2u)

/** \brief Mask for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_MSK (0x3u)

/** \brief Offset for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_OFF (19u)

/** \brief Length for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_LEN (1u)

/** \brief Mask for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_MSK (0x1u)

/** \brief Offset for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_OFF (21u)

/** \brief Length for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_LEN (1u)

/** \brief Mask for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_MSK (0x1u)

/** \brief Offset for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_OFF (22u)

/** \brief Length for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_OFF (0u)

/** \brief Length for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_OFF (2u)

/** \brief Length for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_OFF (4u)

/** \brief Length for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_LEN (1u)

/** \brief Mask for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_OFF (7u)

/** \brief Length for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_OFF (8u)

/** \brief Length for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_LEN (1u)

/** \brief Mask for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_OFF (11u)

/** \brief Length for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_OFF (12u)

/** \brief Length for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_LEN (2u)

/** \brief Mask for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_OFF (14u)

/** \brief Length for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISR_Bits.DEDI */
#define IFX_MSC_ISR_DEDI_OFF (0u)

/** \brief Length for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISR_Bits.DECI */
#define IFX_MSC_ISR_DECI_OFF (1u)

/** \brief Length for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISR_Bits.DTFI */
#define IFX_MSC_ISR_DTFI_OFF (2u)

/** \brief Length for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISR_Bits.URDI */
#define IFX_MSC_ISR_URDI_OFF (3u)

/** \brief Length for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_OFF (0u)

/** \brief Length for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_OFF (1u)

/** \brief Length for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_MSK (0x1u)

