HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMsc_bf.h
/** \brief Length for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_LEN (2u)

/** \brief Mask for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_OFF (13u)

/** \brief Length for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_OFF (15u)

/** \brief Length for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_LEN (3u)

/** \brief Mask for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_MSK (0x7u)

/** \brief Offset for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_OFF (16u)

/** \brief Length for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_OFF (19u)

/** \brief Length for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_OFF (21u)

/** \brief Length for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_OFF (23u)

/** \brief Length for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_LEN (2u)

/** \brief Mask for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_OFF (24u)

/** \brief Length for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_OFF (26u)

/** \brief Length for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_LEN (3u)

/** \brief Mask for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_MSK (0x7u)

/** \brief Offset for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_OFF (27u)

/** \brief Length for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_OFF (31u)

/** \brief Length for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_MSC_OCS_Bits.SUS */
#define IFX_MSC_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MSC_KRSTCLR_Bits.CLR */
#define IFX_MSC_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_MSC_KRST1_Bits.RST */
#define IFX_MSC_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_MSC_KRST0_Bits.RST */
#define IFX_MSC_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_MSC_KRST0_Bits.RSTSTAT */
#define IFX_MSC_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN1 */
#define IFX_MSC_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN1 */
#define IFX_MSC_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN1 */
#define IFX_MSC_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN2 */
#define IFX_MSC_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN3 */
#define IFX_MSC_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN4 */
#define IFX_MSC_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN5 */
#define IFX_MSC_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ACCEN0_Bits.EN6 */
#define IFX_MSC_ACCEN0_EN6_OFF (6u)

